import 'package:flutter/material.dart';


// Archive Page Metadata
final List<List<Map<String, dynamic>>> rounds = [
    [
      
      {'title': 'تعديل قانون التعليم العام', 'details': 'اقتراح لزيادة مخصصات التعليم وتحسين البنية التحتية للمدارس في المناطق النائية.', 'date': 'الإثنين 16-09-2024', 'result': '60% لا أوافق', 'myvote': 'لا اوافق', 'parlvote': '53% أوافق', 'icon': Icons.school_outlined},
      {'title': 'قانون دعم رواد الأعمال والشركات الناشئة', 'details': 'اقتراح لتقديم دعم مالي للشركات الناشئة وتخفيف الضرائب لمدة 5 سنوات.', 'date': 'الثلاثاء 17-09-2024', 'result': '77% أوافق', 'myvote': 'اوافق', 'parlvote': '93% أوافق', 'icon': Icons.business_center_outlined},
    ],
    [
      {'title': 'مشروع قانون تنظيم التجارة الإلكترونية', 'details': 'اقتراح لوضع قوانين جديدة تضمن حقوق المستهلكين وتعزيز الأمن الإلكتروني.', 'date': 'الأربعاء 18-09-2024', 'result': '54% أوافق', 'myvote': 'لا اوافق', 'parlvote': '63% أوافق', 'icon': Icons.local_gas_station_outlined},
    ],
    [
      {'title': 'تعديل قانون التعليم العام', 'details': 'اقتراح لزيادة مخصصات التعليم وتحسين البنية التحتية للمدارس في المناطق النائية.', 'date': 'الإثنين 16-09-2024', 'result': '60% أوافق', 'myvote': 'اوافق', 'parlvote': '66% أوافق', 'icon': Icons.school_outlined},
      {'title': 'قانون دعم رواد الأعمال والشركات الناشئة', 'details': 'اقتراح لتقديم دعم مالي للشركات الناشئة وتخفيف الضرائب لمدة 5 سنوات.', 'date': 'الثلاثاء 17-09-2024', 'result': '93% أوافق', 'myvote': 'اوافق', 'parlvote': '85% أوافق', 'icon': Icons.park_outlined},
    ],
    [
      {'title': 'مشروع قانون تنظيم التجارة الإلكترونية', 'details': 'اقتراح لوضع قوانين جديدة تضمن حقوق المستهلكين وتعزيز الأمن الإلكتروني.', 'date': 'الأربعاء 18-09-2024', 'result': '54% أوافق', 'myvote': 'لا اوافق', 'parlvote': '63% أوافق', 'icon': Icons.local_gas_station_outlined},
    ],
  ];

  ///////////////////////////////////////////////////////////////////////////////////////////////////////////
  ///////////////////////////////////////////////////////////////////////////////////////////////////////////
 
  



 // Suggestion Page Metadata

  final List<String> governorates = [  // المحافظات
  'العاصمة',
  'الزرقاء',
  'إربد',
  'المفرق',
  'جرش',
  'عجلون',
  'مادبا',
  'الكرك',
  'الطفيلة',
  'معان',
  'العقبة',
  'البلقاء'
];


final Map<String, List<String>> municipalities = {   // المحافظات مع المناطق التابعة لها //
  'العاصمة': [
    'وسط البلد', 'جبل القلعة', 'اللويبدة', 'الحسين', 'جبل عمان (الدوار الأول إلى الثالث)',
    'حي الأمير حسن', 'حي الأمير هاشم', 'حي طارق', 'حي نايفة', 'حي المهاجرين','ماركا الشمالية', 'ماركا الجنوبية', 'حي المحطة', 'حي الزهراء', 'حي الزرقاء','جبل النصر', 'حي الذراع', 'حي نزال', 'حي القصور',
    'جبل الزهور', 'جبل التاج', 'حي الروابي', 'حي المعادي','جبل الجوفة', 'جبل النظيف', 'حي الحيدرية', 'الكسارات','حي اليرموك', 'حي السعادة', 'حي السويطي', 'حي الجوفة',
    'عبدون', 'أم أذينة', 'الرابية', 'الصويفية','جبل الحسين', 'العبدلي', 'شارع الاستقلال', 'جبل اللويبدة','طبربور', 'حي الشهيد', 'حي الزهور', 'ُأم زويتينة',
    'الجبيهة', 'ضاحية الرشيد', 'حي الجامعة', 'ُأم زويتينة','شفا بدران', 'ُالكمالية', 'حي الندى', 'أبو نصير','القويسمة', 'أبو علندا', 'الجويدة', 'اليادودة',
    'خريبة السوق', 'جاوا', 'أم الحيران', 'المقابلين','وادي السير', 'البيادر', 'عراق الأمير', 'حي الجندويل','صويلح', 'حي الإرسال', 'حي القادسية', 'إسكان الأمير فيصل',
    'المُقابلين', 'أم قصير', 'حي النهضة', 'البنيات','تلاع العلي', 'خلدا', 'أم السماق', 'حي الرابية','بدر الجديدة', 'الكمالية', 'ضاحية الحاج حسن',
    'ْْأبو نصير', 'حيُ القصور', 'الكماليةُ','أحد', 'زبدا', 'الرجم','مرج الحمام', 'حي السلام', 'الحنينة', 'الكرامة',
    
    'سحاب','أم البساتين', 'تجمع سكاني (السامك)','الموقر', 'الحاتمية', 'منشية القضاه', 'مغاير المهنا', 
    'الفيصلية', 'النقيرة', 'ام بطمة', 'ذهيبة الشرقية', 'رجم الشامي الغربي و سالم', 'رجم الشامي الشرقي', 'الذهيبة الغربية', 'الهاشمية و الكتيفه و اللسين', 'تجمع سكاني (روضة الحسين)',
    'ام الرصاص', 'طور الحشاش و الندوة', 'الرميل و عليان', 'الرامة و المشيرفة و الياهون', 'الفيصلية, الدامخي','الجميل, ثريا',
    'الجيزة', 'القسطل و المشتى', 'منجا و الزيتونة', 'اللبن و الطنيب', 'ام العمد و الخضراء', 'نتل و الزعفران', 'حواره و المناره و جلول', 'ام الوليد و ام قيصر', 'ارينبة الغربية', 'العامرية', 
    'دليلة, صوفه, النيروز',' القنيطرة,منطقة المطار','ام رمانه, الغبية','السيفيه, مخيم الطالبية زويزا',
    'ناعور', 'العدسية', 'الروضة','المشقر', 'العال', 'حسبان','ًالعامرية'],

  'الزرقاء': [
    'الزرقاء الجديدة', 'الرصيفة', 'الهاشمية الجديدة', 'بيرين', 'الظليل', 'الحلابات', 'الأزرق الشمالي', 'تجمع الأزرق الجنوبي', 'منطقة العمري الحدودية', 
    'عرجان', 'أم صليح وغرسا', 'السخنة', 'قرى بني هاشم', 'أم رمانة ورجم الشوك', 'العالوك المسرات', 'الكمشة', 'صروت', 'التجمعات السكانية (الرياض ومرحب)', 'الوهادنة'],

  'إربد': [
    'اربد', 'فوعرا', 'بيت راس', 'كفر جايز', 'حكما', 'مرو', 'علعال', 'المغير', 'سال', 'بشرى', 'حواره', 'الصريح', 'ايدون', 'الحصن', 'النعيمة', 'كتم','كفر يوبا', 
    'بيت يافا', 'زحر', 'سوم', 'ججين', 'دوقرا','الرمثا', 'البويضه','الطره', 'الشجره', 'عمراوه', 'الذنيبه','ملكا', 'المنصورة', 'ام قيس', 'الحمة الاردنية', 'المخيبة','حبراص', 
    'حرثا', 'يبلا', 'الرفيد', 'عقربا', 'كفرسوم','حريما', 'خرجا', 'اليرموك','الشونة الشمالية', 'العدسية', 'المنشية', 'وقاص','سمر', 'سحم','سما الروسان', 'حاتم','الشيخ حسين', 
    'المشارع','كريمه', 'وادي الريان','المزار الشمالي', 'عنبه', 'دير يوسف', 'جحفيه', 'ارحابا', 'زوبيا''الطيبة', 'دير السعنة', 'صما'],

 'المفرق': [
    'المفرق', 'ام النعام الشرقية', 'ايدون بني حسن', 'ثغرة الجب', 'ام النعام الغربية', 'الغدير الابيض','رحاب بني حسن', 'الدجنية', 'حمامة العليمات', 'حمامة العموش', 'هويشان', 'الدقمسة', 'نادرة', 
    'المدور', 'ام بطمه', 'دحل', 'خطلة', 'حميدو الكرام', 'ابو السوس', 'ام رمانه', 'ام خروبه', 'السحري','بلعما', 'حيان الرويبض', 'الزنية', 'المزرعة', 'الخربة السمراء',
    'حوشا', 'الحمراء', 'المَنصورة','منشية بني حسن','الخالدية','الحرش', 'فاع','الزعتري', 'منشية السلطة','سما السرحان', 'مغير السرحان', 'جابر السرحان', 'روابي السرحان',
    'ام السرب', 'الباعج', 'النهضة', 'الزبيدية', 'حويجة', 'ام الجمال', 'الكوم الاحمر و رسم الحصان', 'روضة الاميرة بسمة', 'عمره و عميرة','صبحا و صبحية', 'الدفيانة', 'كوم الرف',
    'ام القطين', 'المكيفته','دير الكهف', 'دير القن', 'قاسم','الرويشد', 'منشية الغياث', 'الروضة', 'الريشة الغربية', 'الاثني', 'المشاقيق', 'الريشة الشرقية', 
    'الرقبان', 'مركز حدود الكرامة','الصالحية', 'نايفة'],

  'جرش': [
    'جرش', 'سوف', 'الكفيرء','ريمون', 'نحلة', 'الكته', 'ساكب','مرصع', 'المصطبة', 'جبة','قفقفا', 'الربوه', 'كفرخل', 'بليلا','برما' ],

  'عجلون': [
    'عجلون', 'عنجرة', 'عين جنا', 'الروابي', 'الصفا','كفرنجة', 'راجب','صخرة', 'عبين و عبلين','ُالهاشمية', 'حلاوة', 'ُالوهادنة','باعون', 'راسون', 'اوصره', 'ُعرجان'],

  'مادبا': [
    'مادبا', 'الفيصلية', 'جرينة الشوابكة', 'غرناطة و العريش', 'ماعين', 'المريجات و الحوية','ذيبان', 'العالية', 'الشقيق','لب', 'مليح','جبل بني حميدة'],

  'الكرك': [
    'الكرك', 'بذان وبردى', 'العدنانية', 'منشية ابو حمور', 'ادر', 'الجديدة', 'زيد بن حارثة', 'الشهابية', 'الثنية', 'وادي الكرك',
    'السلطاني', 'الوادي الابيض','القطرانة','طلال', 'الجدعا','محي', 'مؤاب', 'ذات راس','سول', 'المزار الجنوبي', 'العراق', 'ُالطيبة', 'جعفر','اعي', 'جوزا', 'كثرب',
    'السماكية', 'القصر', 'الياروت', 'الربة','فقوع', 'امرع', 'صرفا','غور المزرعة والحديثة', 'غور الصافي'],

  'الطفيلة': [
    'الطفيلة', 'عين البيضاء', 'العيص', 'الحسين (رويم, صنفحه, عرفه)', 'عيمه','بصيرا', 'غرندل','القادسية', 'اسكان مصنع اسمنت الجنوب', 'بلدية ضانا','الحسا', 'جرف الدراويش'],

  'معان': [
    'معان','ُالمنشية', 'تجمع سكاني الجربا', 'اذرح','الجفر','الحسينية', 'ُُالهاشمية','الشراه', 'المريغة','الشوبك', 'العبدلية', 'حمزة','الفردخ', 'ايل', 'الامير راشد', 'بسطة'],

  'العقبة': [
    'القويرة', 'الراشدية', 'الحميمة و العباسية و العسلية','الديسة','قريقرة و فينان','وادي عربه','قطر ورحمة'],

  'البلقاء': [
    'السلط', 'يرقا', 'عيرا', 'زي', 'علان', 'الرميمين', 'ام جوزه', 'وادي الحور و تجمع سكاني اليزيدية',
    'صافوت', 'ابو نصير', 'ام الدنانير', '(موبص, السليحي, سلحوب)','(ام انجاصه, الرمان)',
    'الصبيحي', 'خالد بن الوليد', 'بيوضه', 'تجمع سكاني سوميا','دير علا', 'ابو عبيدة و البلاونة', 'خزمه', 'ضرار', 'الطوال الشمالي', 'الطوال الجنوبي',
    'معدي', 'مثلث العارضة', 'ظهر الرمل', 'داميا','سويمة','الشونة الجديدة', 'الشونة الجنوبية', 'ُالكرامة', 'الكفرين', 'الروضةُ', 'الرامة','الفحيص','ماحص'],

};


final Map<String, List<String>> areas = {   // المناطق داخل البلديات //

  // محافظة العاصمة
  'وسط البلد': ['منطقة المدينة - أمانة عمان الكبرى'],
  'جبل القلعة': ['منطقة المدينة - أمانة عمان الكبرى'],
  'اللويبدة': ['منطقة المدينة - أمانة عمان الكبرى'],
  'الحسين': ['منطقة المدينة - أمانة عمان الكبرى'],
  'جبل عمان (الدوار الأول إلى الثالث)': ['منطقة المدينة - أمانة عمان الكبرى'],

  'حي الأمير حسن': ['منطقة بسمان - أمانة عمان الكبرى'],
  'حي الأمير هاشم': ['منطقة بسمان - أمانة عمان الكبرى'],
  'حي طارق': ['منطقة بسمان - أمانة عمان الكبرى'],
  'حي نايفة': ['منطقة بسمان - أمانة عمان الكبرى'],
  'حي المهاجرين': ['منطقة بسمان - أمانة عمان الكبرى'],

  'ماركا الشمالية': ['منطقة ماركا - أمانة عمان الكبرى'],
  'ماركا الجنوبية': ['منطقة ماركا - أمانة عمان الكبرى'],
  'حي المحطة': ['منطقة ماركا - أمانة عمان الكبرى'],
  'حي الزهراء': ['منطقة ماركا - أمانة عمان الكبرى'],
  'حي الزرقاء': ['منطقة ماركا - أمانة عمان الكبرى'],

  'جبل النصر': ['منطقة النصر - أمانة عمان الكبرى'],
  'حي الذراع': ['منطقة النصر - أمانة عمان الكبرى'],
  'حي نزال': ['منطقة النصر - أمانة عمان الكبرى'],
  'حي القصور': ['منطقة النصر - أمانة عمان الكبرى'],

  'جبل الزهور': ['منطقة بدر - أمانة عمان الكبرى'],
  'جبل التاج': ['منطقة بدر - أمانة عمان الكبرى'],
  'حي الروابي': ['منطقة بدر - أمانة عمان الكبرى'],
  'حي المعادي': ['منطقة بدر - أمانة عمان الكبرى'],

  'جبل الجوفة': ['منطقة رأس العين - أمانة عمان الكبرى'],
  'جبل النظيف': ['منطقة رأس العين - أمانة عمان الكبرى'],
  'حي الحيدرية': ['منطقة رأس العين - أمانة عمان الكبرى'],
  'الكسارات': ['منطقة رأس العين - أمانة عمان الكبرى'],

  'حي اليرموك': ['منطقة اليرموك - أمانة عمان الكبرى'],
  'حي السعادة': ['منطقة اليرموك - أمانة عمان الكبرى'],
  'حي السويطي': ['منطقة اليرموك - أمانة عمان الكبرى'],
  'حي الجوفة': ['منطقة اليرموك - أمانة عمان الكبرى'],

  'عبدون': ['منطقة زهران - أمانة عمان الكبرى'],
  'أم أذينة': ['منطقة زهران - أمانة عمان الكبرى'],
  'الرابية': ['منطقة زهران - أمانة عمان الكبرى'],
  'الصويفية': ['منطقة زهران - أمانة عمان الكبرى'],

  'جبل الحسين': ['منطقة العبدلي - أمانة عمان الكبرى'],
  'العبدلي': ['منطقة العبدلي - أمانة عمان الكبرى'],
  'شارع الاستقلال': ['منطقة العبدلي - أمانة عمان الكبرى'],
  'جبل اللويبدة': ['منطقة العبدلي - أمانة عمان الكبرى'],

  'طبربور': ['منطقة طارق (طبربور) - أمانة عمان الكبرى'],
  'حي الشهيد': ['منطقة طارق (طبربور) - أمانة عمان الكبرى'],
  'حي الزهور': ['منطقة طارق (طبربور) - أمانة عمان الكبرى'],
  'أم زويتينة': ['منطقة طارق (طبربور) - أمانة عمان الكبرى'],

  'الجبيهة': ['منطقة الجبيهة - أمانة عمان الكبرى'],
  'ضاحية الرشيد': ['منطقة الجبيهة - أمانة عمان الكبرى'],
  'حي الجامعة': ['منطقة الجبيهة - أمانة عمان الكبرى'],
  'ُأم زويتينة': ['منطقة الجبيهة - أمانة عمان الكبرى'],

  'شفا بدران': ['منطقة شفا بدران - أمانة عمان الكبرى'],
  'الكمالية': ['منطقة شفا بدران - أمانة عمان الكبرى'],
  'حي الندى': ['منطقة شفا بدران - أمانة عمان الكبرى'],
  'أبو نصير': ['منطقة شفا بدران - أمانة عمان الكبرى'],

  'القويسمة': ['منطقة القويسمة وأبو علندا - أمانة عمان الكبرى'],
  'أبو علندا': ['منطقة القويسمة وأبو علندا - أمانة عمان الكبرى'],
  'الجويدة': ['منطقة القويسمة وأبو علندا - أمانة عمان الكبرى'],
  'اليادودة': ['منطقة القويسمة وأبو علندا - أمانة عمان الكبرى'],

  'خريبة السوق': ['منطقة خريبة السوق - أمانة عمان الكبرى'],
  'جاوا': ['منطقة خريبة السوق - أمانة عمان الكبرى'],
  'أم الحيران': ['منطقة خريبة السوق - أمانة عمان الكبرى'],
  'المقابلين': ['منطقة خريبة السوق - أمانة عمان الكبرى'],

  'وادي السير': ['منطقة وادي السير - أمانة عمان الكبرى'],
  'البيادر': ['منطقة وادي السير - أمانة عمان الكبرى'],
  'عراق الأمير': ['منطقة وادي السير - أمانة عمان الكبرى'],
  'حي الجندويل': ['منطقة وادي السير - أمانة عمان الكبرى'],

  'صويلح': ['منطقة صويلح - أمانة عمان الكبرى'],
  'حي الإرسال': ['منطقة صويلح - أمانة عمان الكبرى'],
  'حي القادسية': ['منطقة صويلح - أمانة عمان الكبرى'],
  'إسكان الأمير فيصل': ['منطقة صويلح - أمانة عمان الكبرى'],

  'المُقابلين': ['منطقة المقابلين وأم قصير - أمانة عمان الكبرى'],
  'أم قصير': ['منطقة المقابلين وأم قصير - أمانة عمان الكبرى'],
  'حي النهضة': ['منطقة المقابلين وأم قصير - أمانة عمان الكبرى'],
  'البنيات': ['منطقة المقابلين وأم قصير - أمانة عمان الكبرى'],

  'تلاع العلي': ['منطقة تلاع العلي وخلدا وأم السماق - أمانة عمان الكبرى'],
  'خلدا': ['منطقة تلاع العلي وخلدا وأم السماق - أمانة عمان الكبرى'],
  'أم السماق': ['منطقة تلاع العلي وخلدا وأم السماق - أمانة عمان الكبرى'],
  'حي الرابية': ['منطقة تلاع العلي وخلدا وأم السماق - أمانة عمان الكبرى'],

  'بدر الجديدة': ['منطقة بدر الجديدة - أمانة عمان الكبرى'],
  'ُالكمالية': ['منطقة بدر الجديدة - أمانة عمان الكبرى'],
  'ضاحية الحاج حسن': ['منطقة بدر الجديدة - أمانة عمان الكبرى'],

  'ْأبو نصير': ['منطقة أبو نصير - أمانة عمان الكبرى'],
  'حيُ القصور': ['منطقة أبو نصير - أمانة عمان الكبرى'],
  'الكماليةُ': ['منطقة أبو نصير - أمانة عمان الكبرى'],

  'أحد': ['منطقة أحد - أمانة عمان الكبرى'],
  'زبدا': ['منطقة أحد - أمانة عمان الكبرى'],
  'الرجم': ['منطقة أحد - أمانة عمان الكبرى'],

  'مرج الحمام': ['منطقة مرج الحمام - أمانة عمان الكبرى'],
  'حي السلام': ['منطقة مرج الحمام - أمانة عمان الكبرى'],
  'الحنينة': ['منطقة مرج الحمام - أمانة عمان الكبرى'],
  'الكرامة': ['منطقة مرج الحمام - أمانة عمان الكبرى'],

  'سحاب': ['بلدية سحاب'],

  'أم البساتين': ['بلدية أم البساتين'],
  'تجمع سكاني (السامك)': ['بلدية أم البساتين'],

  'الموقر': ['بلدية الموقر'],
  'الحاتمية': ['بلدية الموقر'],
  'منشية القضاه': ['بلدية الموقر'],
  'مغاير المهنا': ['بلدية الموقر'],
  'الفيصلية': ['بلدية الموقر'],
  'النقيرة': ['بلدية الموقر'],
  'ام بطمة': ['بلدية الموقر'],
  'ذهيبة الشرقية': ['بلدية الموقر'],
  'رجم الشامي الغربي و سالم': ['بلدية الموقر'],
  'رجم الشامي الشرقي': ['بلدية الموقر'],
  'الذهيبة الغربية': ['بلدية الموقر'],
  'الهاشمية و الكتيفه و اللسين': ['بلدية الموقر'],
  'تجمع سكاني (روضة الحسين)': ['بلدية الموقر'],

  'ام الرصاص': ['بلدية أم الرصاص الجديدة'],
  'طور الحشاش و الندوة': ['بلدية أم الرصاص الجديدة'],
  'الرميل و عليان': ['بلدية أم الرصاص الجديدة'],
  'الرامة و المشيرفة و الياهون': ['بلدية أم الرصاص الجديدة'],
  'الفيصلية, الدامخي': ['بلدية أم الرصاص الجديدة'],
  'الجميل, ثريا': ['بلدية أم الرصاص الجديدة'],

  'الجيزة': ['بلدية الجيزة الجديدة'],
  'القسطل و المشتى': ['بلدية الجيزة الجديدة'],
  'منجا و الزيتونة': ['بلدية الجيزة الجديدة'],
  'اللبن و الطنيب': ['بلدية الجيزة الجديدة'],
  'ام العمد و الخضراء': ['بلدية الجيزة الجديدة'],
  'نتل و الزعفران': ['بلدية الجيزة الجديدة'],
  'حواره و المناره و جلول': ['بلدية الجيزة الجديدة'],
  'ام الوليد و ام قيصر': ['بلدية الجيزة الجديدة'],
  'ارينبة الغربية': ['بلدية الجيزة الجديدة'],
  'العامرية': ['بلدية الجيزة الجديدة'],
  'دليلة, صوفه, النيروز': ['بلدية الجيزة الجديدة'],
  'السيفيه, مخيم الطالبية زويزا': ['بلدية الجيزة الجديدة'],
  'القنيطرة,منطقة المطار': ['بلدية الجيزة الجديدة'],
   'ام رمانه, الغبية': ['بلدية الجيزة الجديدة'],

  'ناعور': ['بلدية ناعور'],
  'العدسية': ['بلدية ناعور'],
  'الروضة': ['بلدية ناعور'],

  'المشقر': ['بلدية حسبان'],
  'العال': ['بلدية حسبان'],
  'حسبان': ['بلدية حسبان'],

  'ًالعامرية': ['بلدية العامرية'],
//////////////////////////////////////////////////////
  // محافظة الزرقاء

  'الزرقاء': ['بلدية الزرقاء'],

  'الرصيفة': ['بلدية الرصيفة'],

  'الهاشمية': ['بلدية الهاشمية الجديدة'],
  'أم صليح وغرسا': ['بلدية الهاشمية الجديدة'],
  'السخنة': ['بلدية الهاشمية الجديدة'],
  'قرى بني هاشم': ['بلدية الهاشمية الجديدة'],

  'بيرين': ['بلدية بيرين الجديدة'],
  'أم رمانة ورجم الشوك': ['بلدية بيرين الجديدة'],
  'العالوك المسرات': ['بلدية بيرين الجديدة'],
  'الكمشة': ['بلدية بيرين الجديدة'],
  'صروت': ['بلدية بيرين الجديدة'],
  'التجمعات السكانية (الرياض ومرحب)': ['بلدية بيرين الجديدة'],
  'الوهادنة': ['بلدية بيرين الجديدة'],

  'الظليل': ['بلدية الظليل'],

  'الحلابات': ['بلدية الحلابات'],

  'الأزرق الشمالي': ['بلدية الأزرق'],
  'تجمع الأزرق الجنوبي': ['بلدية الأزرق'],
  'منطقة العمري الحدودية': ['بلدية الأزرق'],
  'عرجان': ['بلدية الأزرق'],
//////////////////////////////////////////////////////
  // محافظة إربد
  'اربد': ['بلدية اربد الكبرى'],
  'فوعرا': ['بلدية اربد الكبرى'],
  'بيت راس': ['بلدية اربد الكبرى'],
  'كفر جايز': ['بلدية اربد الكبرى'],
  'حكما': ['بلدية اربد الكبرى'],
  'مرو': ['بلدية اربد الكبرى'],
  'علعال': ['بلدية اربد الكبرى'],
  'المغير': ['بلدية اربد الكبرى'],
  'سال': ['بلدية اربد الكبرى'],
  'بشرى': ['بلدية اربد الكبرى'],
  'حواره': ['بلدية اربد الكبرى'],
  'الصريح': ['بلدية اربد الكبرى'],
  'ايدون': ['بلدية اربد الكبرى'],
  'الحصن': ['بلدية اربد الكبرى'],
  'النعيمة': ['بلدية اربد الكبرى'],
  'كتم': ['بلدية اربد الكبرى'],

  'كفر يوبا': ['بلدية غرب اربد'],
  'بيت يافا': ['بلدية غرب اربد'],
  'زحر': ['بلدية غرب اربد'],
  'سوم': ['بلدية غرب اربد'],
  'ججين': ['بلدية غرب اربد'],
  'دوقرا': ['بلدية غرب اربد'],

  'الرمثا': ['بلدية الرمثا الجديدة'],
  'البويضه': ['بلدية الرمثا الجديدة'],

  'الطره': ['بلدية سهل حوران'],
  'الشجره': ['بلدية سهل حوران'],
  'عمراوه': ['بلدية سهل حوران'],
  'الذنيبه': ['بلدية سهل حوران'],

  'ملكا': ['بلدية خالد بن الوليد'],
  'المنصورة': ['بلدية خالد بن الوليد'],
  'ام قيس': ['بلدية خالد بن الوليد'],
  'الحمة الاردنية': ['بلدية خالد بن الوليد'],
  'المخيبة': ['بلدية خالد بن الوليد'],

  'حبراص': ['بلدية الكفارات'],
  'حرثا': ['بلدية الكفارات'],
  'يبلا': ['بلدية الكفارات'],
  'الرفيد': ['بلدية الكفارات'],
  'عقربا': ['بلدية الكفارات'],
  'كفرسوم': ['بلدية الكفارات'],

  'حريما': ['بلدية اليرموك الجديدة'],
  'خرجا': ['بلدية اليرموك الجديدة'],
  'اليرموك': ['بلدية اليرموك الجديدة'],

  'الشونة الشمالية': ['بلدية معاذ بن جبل'],
  'العدسية': ['بلدية معاذ بن جبل'],
  'المنشية': ['بلدية معاذ بن جبل'],
  'وقاص': ['بلدية معاذ بن جبل'],

  'سمر': ['بلدية الشعلة'],
  'سحم': ['بلدية الشعلة'],

    'سما الروسان': ['بلدية السرو'],
  'حاتم': ['بلدية السرو'],

  'الشيخ حسين': ['بلدية طبقة فحل'],
  'المشارع': ['بلدية طبقة فحل'],

  'كريمه': ['بلدية شرحبيل بن حسنة'],
  'وادي الريان': ['بلدية شرحبيل بن حسنة'],

  'المزار الشمالي': ['بلدية المزار الجديدة'],
  'عنبه': ['بلدية المزار الجديدة'],
  'دير يوسف': ['بلدية المزار الجديدة'],
  'جحفيه': ['بلدية المزار الجديدة'],
  'ارحابا': ['بلدية المزار الجديدة'],
  'زوبيا': ['بلدية المزار الجديدة'],

  'الطيبة': ['بلدية الطيبة الجديدة'],
  'دير السعنة': ['بلدية الطيبة الجديدة'],
  'صما': ['بلدية الطيبة الجديدة'],

   //////////////////////////////////////////////////////
  // محافظة المفرق
  'المفرق': ['بلدية المفرق الكبرى'],
  'ام النعام الشرقية': ['بلدية المفرق الكبرى'],
  'ايدون بني حسن': ['بلدية المفرق الكبرى'],
  'ثغرة الجب': ['بلدية المفرق الكبرى'],
  'ام النعام الغربية': ['بلدية المفرق الكبرى'],
  'الغدير الابيض': ['بلدية المفرق الكبرى'],

  'رحاب بني حسن': ['بلدية رحاب الجديدة'],
  'الدجنية': ['بلدية رحاب الجديدة'],
  'حمامة العليمات': ['بلدية رحاب الجديدة'],
  'حمامة العموش': ['بلدية رحاب الجديدة'],
  'هويشان': ['بلدية رحاب الجديدة'],
  'الدقمسة': ['بلدية رحاب الجديدة'],
  'نادرة': ['بلدية رحاب الجديدة'],
  'المدور': ['بلدية رحاب الجديدة'],
  'ام بطمه': ['بلدية رحاب الجديدة'],
  'دحل': ['بلدية رحاب الجديدة'],
  'خطلة': ['بلدية رحاب الجديدة'],
  'حميدو الكرام': ['بلدية رحاب الجديدة'],
  'ابو السوس': ['بلدية رحاب الجديدة'],
  'ام رمانه': ['بلدية رحاب الجديدة'],
  'ام خروبه': ['بلدية رحاب الجديدة'],
  'السحري': ['بلدية رحاب الجديدة'],

  'بلعما': ['بلدية بلعما الجديدة'],
  'حيان الرويبض': ['بلدية بلعما الجديدة'],
  'الزنية': ['بلدية بلعما الجديدة'],
  'المزرعة': ['بلدية بلعما الجديدة'],
  'الخربة السمراء': ['بلدية بلعما الجديدة'],

  'حوشا': ['بلدية حوشا الجديدة'],
  'الحمراء': ['بلدية حوشا الجديدة'],
  'المَنصورة': ['بلدية حوشا الجديدة'],

  'منشية بني حسن': ['بلدية منشية بني حسن'],

  'الخالدية': ['بلدية الخالدية'],

  'الحرش': ['بلدية الباسلية'],
  'فاع': ['بلدية الباسلية'],

  'الزعتري': ['بلدية الزعتري والمنشية'],
  'منشية السلطة': ['بلدية الزعتري والمنشية'],

  'سما السرحان': ['بلدية السرحان'],
  'مغير السرحان': ['بلدية السرحان'],
  'جابر السرحان': ['بلدية السرحان'],
  'روابي السرحان': ['بلدية السرحان'],

  'ام السرب': ['بلدية الامير حسين بن عبدالله'],
  'الباعج': ['بلدية الامير حسين بن عبدالله'],
  'النهضة': ['بلدية الامير حسين بن عبدالله'],
  'الزبيدية': ['بلدية الامير حسين بن عبدالله'],
  'حويجة': ['بلدية الامير حسين بن عبدالله'],

  'ام الجمال': ['بلدية ام الجمال الجديدة'],
  'الكوم الاحمر و رسم الحصان': ['بلدية ام الجمال الجديدة'],
  'روضة الاميرة بسمة': ['بلدية ام الجمال الجديدة'],
  'عمره و عميرة': ['بلدية ام الجمال الجديدة'],

  'صبحا و صبحية': ['بلدية صبحا والدفيانه'],
  'الدفيانة': ['بلدية صبحا والدفيانه'],
  'كوم الرف': ['بلدية صبحا والدفيانه'],

  'ام القطين': ['بلدية ام القطين والمكيفته'],
  'المكيفته': ['بلدية ام القطين والمكيفته'],

  'دير الكهف': ['بلدية دير الكهف الجديدة'],
  'دير القن': ['بلدية دير الكهف الجديدة'],
  'قاسم': ['بلدية دير الكهف الجديدة'],

  'الرويشد': ['بلدية الرويشد الجديدة'],
  'منشية الغياث': ['بلدية الرويشد الجديدة'],
  'الروضة': ['بلدية الرويشد الجديدة'],
  'الريشة الغربية': ['بلدية الرويشد الجديدة'],
  'الاثني': ['بلدية الرويشد الجديدة'],
  'المشاقيق': ['بلدية الرويشد الجديدة'],
  'الريشة الشرقية': ['بلدية الرويشد الجديدة'],
  'الرقبان': ['بلدية الرويشد الجديدة'],
  'مركز حدود الكرامة': ['بلدية الرويشد الجديدة'],

  'الصالحية': ['بلدية الصالحية و نايفة'],
  'نايفة': ['بلدية الصالحية و نايفة'],

  'بني هاشم': ['بلدية بني هاشم'],

  'الصفاوي': ['بلدية الصفاوي'],

//////////////////////////////////////////////////////
  // محافظة جرش

  'جرش': ['بلدية جرش الكبرى'],
  'سوف': ['بلدية جرش الكبرى'],
  'الكفيرء': ['بلدية جرش الكبرى'],

  'ريمون': ['بلدية المعراض'],
  'نحلة': ['بلدية المعراض'],
  'الكته': ['بلدية المعراض'],
  'ساكب': ['بلدية المعراض'],

  'مرصع': ['بلدية باب عمان'],
  'المصطبة': ['بلدية باب عمان'],
  'جبة': ['بلدية باب عمان'],

  'قفقفا': ['بلدية النسيم'],
  'الربوه': ['بلدية النسيم'],
  'كفرخل': ['بلدية النسيم'],
  'بليلا': ['بلدية النسيم'],

  'برما': ['بلدية برما'],

//////////////////////////////////////////////////////
// محافظة عجلون
  'عجلون': ['بلدية عجلون الكبرى'],
  'عنجرة': ['بلدية عجلون الكبرى'],
  'عين جنا': ['بلدية عجلون الكبرى'],
  'الروابي': ['بلدية عجلون الكبرى'],
  'الصفا': ['بلدية عجلون الكبرى'],

  'كفرنجة': ['بلدية كفرنجة الجديدة'],
  'راجب': ['بلدية كفرنجة الجديدة'],

  'صخرة': ['بلدية الجنيد'],
  'عبين و عبلين': ['بلدية الجنيد'],

  'ُالهاشمية': ['بلدية الشفا'],
  'حلاوة': ['بلدية الشفا'],
  'ُالوهادنة': ['بلدية الشفا'],

  'باعون': ['بلدية العيون'],
  'راسون': ['بلدية العيون'],
  'اوصره': ['بلدية العيون'],
  'ُعرجان': ['بلدية العيون'],

//////////////////////////////////////////////////////
// محافظة مادبا
  'مادبا': ['بلدية مادبا الكبرى'],
  'الفيصلية': ['بلدية مادبا الكبرى'],
  'جرينة الشوابكة': ['بلدية مادبا الكبرى'],
  'غرناطة و العريش': ['بلدية مادبا الكبرى'],
  'ماعين': ['بلدية مادبا الكبرى'],
  'المريجات و الحوية': ['بلدية مادبا الكبرى'],

  'ذيبان': ['بلدية ذيبان الجديدة'],
  'العالية': ['بلدية ذيبان الجديدة'],
  'الشقيق': ['بلدية ذيبان الجديدة'],

  'لب': ['بلدية لب و مليح'],
  'مليح': ['بلدية لب و مليح'],

  'جبل بني حميدة': ['بلدية جبل بني حميدة'],

//////////////////////////////////////////////////////
  // محافظة الكرك
  'الكرك': ['بلدية الكرك الكبرى'],
  'بذان وبردى': ['بلدية الكرك الكبرى'],
  'العدنانية': ['بلدية الكرك الكبرى'],
  'منشية ابو حمور': ['بلدية الكرك الكبرى'],
  'ادر': ['بلدية الكرك الكبرى'],
  'الجديدة': ['بلدية الكرك الكبرى'],
  'زيد بن حارثة': ['بلدية الكرك الكبرى'],
  'الشهابية': ['بلدية الكرك الكبرى'],
  'الثنية': ['بلدية الكرك الكبرى'],
  'وادي الكرك': ['بلدية الكرك الكبرى'],

  'السلطاني': ['بلدية السلطاني'],
  'الوادي الابيض': ['بلدية السلطاني'],

  'القطرانة': ['بلدية القطرانة'],

  'طلال': ['بلدية طلال الجديدة'],
  'الجدعا': ['بلدية طلال الجديدة'],

  'محي': ['بلدية مؤاب الجديدة'],
  'مؤاب': ['بلدية مؤاب الجديدة'],
  'ذات راس': ['بلدية مؤاب الجديدة'],

  'سول': ['بلدية مؤته والمزار'],
  'المزار الجنوبي': ['بلدية مؤته والمزار'],
  'العراق': ['بلدية مؤته والمزار'],
  'ُالطيبة': ['بلدية مؤته والمزار'],
  'جعفر': ['بلدية مؤته والمزار'],

  'اعي': ['بلدية عي'],
  'جوزا': ['بلدية عي'],
  'كثرب': ['بلدية عي'],

  'السماكية': ['بلدية شيحان'],
  'القصر': ['بلدية شيحان'],
  'الياروت': ['بلدية شيحان'],
  'الربة': ['بلدية شيحان'],

  'فقوع': ['بلدية عبدالله بن رواحه'],
  'امرع': ['بلدية عبدالله بن رواحه'],
  'صرفا': ['بلدية عبدالله بن رواحه'],

  'غور المزرعة والحديثة': ['بلدية الاغوار الجنوبية'],
  'غور الصافي': ['بلدية الاغوار الجنوبية'],

//////////////////////////////////////////////////////
  // محافظة الطفيلة
  'الطفيلة': ['بلدية الطفيلة الكبرى'],
  'عين البيضاء': ['بلدية الطفيلة الكبرى'],
  'العيص': ['بلدية الطفيلة الكبرى'],
  'الحسين (رويم, صنفحه, عرفه)': ['بلدية الطفيلة الكبرى'],
  'عيمه': ['بلدية الطفيلة الكبرى'],

  'بصيرا': ['بلدية بصيرا'],
  'غرندل': ['بلدية بصيرا'],

  'القادسية': ['بلدية القادسية'],
  'اسكان مصنع اسمنت الجنوب': ['بلدية القادسية'],
  'بلدية ضانا': ['بلدية القادسية'],

  'الحسا': ['بلدية الحسا'],
  'جرف الدراويش': ['بلدية الحسا'],

//////////////////////////////////////////////////////
// محافظة معان
  'معان': ['بلدية معان الكبري'],

  'ُالمنشية': ['بلدية الاشعري'],
  'تجمع سكاني الجربا': ['بلدية الاشعري'],
  'اذرح': ['بلدية الاشعري'],

  'الجفر': ['بلدية الجفر'],

  'الحسينية': ['بلدية الحسينية الجديدة'],
  'ُُالهاشمية': ['بلدية الحسينية الجديدة'],

  'الشراه': ['بلدية الشراه'],
  'المريغة': ['بلدية الشراه'],

  'الشوبك': ['بلدية الشوبك الجديدة'],
  'العبدلية': ['بلدية الشوبك الجديدة'],
  'حمزة': ['بلدية الشوبك الجديدة'],

  'الفردخ': ['بلدية ايل الجديدة'],
  'ايل': ['بلدية ايل الجديدة'],
  'الامير راشد': ['بلدية ايل الجديدة'],
  'بسطة': ['بلدية ايل الجديدة'],

//////////////////////////////////////////////////////
  // محافظة العقبة
  'القويرة': ['بلدية القويرة الجديدة'],
  'الراشدية': ['بلدية القويرة الجديدة'],
  'الحميمة و العباسية و العسلية': ['بلدية القويرة الجديدة'],

  'الديسة': ['بلدية حوض الديسة'],

  'قريقرة و فينان': ['بلدية قريقرة وفينان'],

  'وادي عربه': ['بلدية وادي عربة'],

  'قطر ورحمة': ['بلدية قطر ورحمة'],

//////////////////////////////////////////////////////
  // محافظة البلقاء
'السلط': ['بلدية السلط الكبرى'],
  'يرقا': ['بلدية السلط الكبرى'],
  'عيرا': ['بلدية السلط الكبرى'],
  'زي': ['بلدية السلط الكبرى'],
  'علان': ['بلدية السلط الكبرى'],
  'الرميمين': ['بلدية السلط الكبرى'],
  'ام جوزه': ['بلدية السلط الكبرى'],
  'وادي الحور و تجمع سكاني اليزيدية': ['بلدية السلط الكبرى'],

  'صافوت': ['بلدية عين الباشا'],
  'ابو نصير': ['بلدية عين الباشا'],
  'ام الدنانير': ['بلدية عين الباشا'],
  '(ام انجاصه, الرمان)': ['بلدية عين الباشا'],
 '(موبص, السليحي, سلحوب)': ['بلدية عين الباشا'],

  'الصبيحي': ['بلدية العارضة الجديدة'],
  'خالد بن الوليد': ['بلدية العارضة الجديدة'],
  'بيوضه': ['بلدية العارضة الجديدة'],
  'تجمع سكاني سوميا': ['بلدية العارضة الجديدة'],

  'دير علا': ['بلدية دير علا الجديدة'],
  'ابو عبيدة و البلاونة': ['بلدية دير علا الجديدة'],
  'خزمه': ['بلدية دير علا الجديدة'],
  'ضرار': ['بلدية دير علا الجديدة'],
  'الطوال الشمالي': ['بلدية دير علا الجديدة'],
  'الطوال الجنوبي': ['بلدية دير علا الجديدة'],

  'معدي': ['بلدية معدي الجديدة'],
  'مثلث العارضة': ['بلدية معدي الجديدة'],
  'ظهر الرمل': ['بلدية معدي الجديدة'],
  'داميا': ['بلدية معدي الجديدة'],

  'سويمة': ['بلدية سويمة'],

  'الشونة الجديدة': ['بلدية الشونة الوسطى'],
  'الشونة الجنوبية': ['بلدية الشونة الوسطى'],
  'ُالكرامة': ['بلدية الشونة الوسطى'],
  'الكفرين': ['بلدية الشونة الوسطى'],
  'الروضةُ': ['بلدية الشونة الوسطى'],
  'الرامة': ['بلدية الشونة الوسطى'],

  'الفحيص': ['بلدية الفحيص'],

  'ماحص': ['بلدية ماحص'],

};